[
    {
        "category": "דרכי התקשרות עם הרשות המקומית וראש הרשות", 
        "fields": [
            "הכתובת הפיזית של משרדי הרשות", 
            "מספרי טלפון (מרכזיית הרשות/שלוחות)", 
            "אימייל כללי לרשות/ טופס פניה מקוון", 
            "שם ראש הרשות", 
            "מספר טלפון של ראש הרשות", 
            "אימייל/ טופס מקוון ליצירת קשר עם ראש הרשות"
        ]
    }, 
    {
        "category": "דרכי התקשרות עם האגף והמחלקה", 
        "fields": [
            "קיים מוקד עירוני באתר הרשות", 
            "במוקד העירוני יש אפשרות מעקב אחר הטיפול בפניות", 
            "שם מנהל/ת האגף", 
            "רמת האגף: טלפון", 
            "רמת האגף: אימייל/טופס מקוון/צור קשר", 
            "כתובת פיזית של האגף", 
            "שעות קבלת קהל באגף", 
            "שם מנהל/ת המחלקה (בהנחה ששמות המחלקות קיימים)", 
            "רמת המחלקה: טלפון"
        ]
    }, 
    {
        "category": "דרכי התקשרות עם חברי מועצה", 
        "fields": [
            "רשימה של חברי מועצה", 
            "מופיעה רשימה של סמכויותיהם של חברי המועצה(לדוגמה, נושא תיק התחדשות עירונית, או חבר/ה בוועדה עירונית מסוימת)", 
            "לכל חבר/ת מועצה מצוין אימייל/טופס מקוון", 
            "מצוין מספר טלפון נייח", 
            "יש/אין פורומים", 
            "כן/לא נוכחות בפייסבוק / טוויטר ועוד"
        ]
    }, 
    {
        "category": "מבקר העירייה", 
        "fields": [
            "פרסום הדו\"ח השנתי האחרון (2011) של מבקר הרשות", 
            "פרסום דו\"חות השנתיים הקודמות (2009-2010) של מבקר הרשות", 
            "פרסום פרטי קשר של מבקר הרשות, ודרכי הפנייה אליו"
        ]
    }, 
    {
        "category": "שקיפות: לפי חוק חופש המידע", 
        "fields": [
            "פרסום הדו\"ח השנתי האחרון (2011)", 
            "פרסום דו\"חות השנתיים הקודמות (2010-2009)", 
            "המבנה הארגוני מוצג באתר", 
            "פרסום חוק חופש המידע", 
            "פרסום שם הממונה על חופש המידע", 
            "אימייל אישי/טופס פנייה מקוון לממונה", 
            "מספר הטלפון במשרד הממונה"
        ]
    }, 
    {
        "category": "פניות הציבור", 
        "fields": [
            "פרסום שם הממונה על פניות/תלונות הציבור", 
            "אימייל אישי/טופס פנייה מקוון לממונה", 
            "מספר הטלפון במשרד הממונה"
        ]
    }, 
    {
        "category": "שקיפות: נדרש ע\"פ חוק חופש המידע", 
        "fields": [
            "רשימת מאגרי מידע", 
            "פרסום מאגרי מידע באתר", 
            "פרטי קשר למנהל/ת מאגר המידע", 
            "סקירת עיקרי פעולות הרשות המתוכננות לשנה הנוכחית (2012)", 
            "פרסום חוקי עזר עירוניים (מספיק אם יש קישור)"
        ]
    }, 
    {
        "category": "מענקים ותמיכות", 
        "fields": [
            "רשימת קרנות ומלגות שבמימון הרשות הציבורית (ע\"פ חוק חופש המידע)", 
            "קריטריונים למתן קרנות ומלגות שבמימון הרשות הציבורית (תוספת – המידע אינו נדרש ע\"פ חוק חופש המידע)", 
            "רשימת תמיכות וחסויות שנתנה הרשות הציבורית בשנה החולפת (ע\"פ חוק חופש המידע)", 
            "קריטריונים למתן תמיכות וחסויות (תוספת – המידע אינו נדרש ע\"פ חוק חופש המידע)", 
            "רשימת מוסדות הציבור שזכו לתמיכה בשנה החולפת", 
            "היקף התמיכה במוסדות הציבור", 
            "ניתן להגיש בקשה למענק באמצעות אתר האינטרנט", 
            "הקצאת מבני ציבור", 
            "שינוי ייעוד של מבני ציבור", 
            "פרסום מידע בנוגע להקצאת קרקע כתמיכה למטרות ציבוריות", 
            "פרסום הקריטריונים לזכייה", 
            "פרסום שמות המבקשים", 
            "פרסום שמות הזוכים", 
            "פרסום מוקדם של סדר יום של ועדת מענקים תמיכות", 
            "פרסום של הפרוטוקולים של דיוני ועדת מענקים ותמיכות"
        ]
    }, 
    {
        "category": "שקיפות: לא נדרש ע\"פ החוק", 
        "fields": [
            "פרסום קוד אתי", 
            "פרסום טפסים לגבי ניגודי עניינים של נבחרי ציבור ובכירים (לדוגמה, ראש הרשות וסגניו, חברי מועצה, מנכ\"ל והנהלה בכירה)", 
            "פרסום הסכמים קואליציוניים", 
            "מידע סטטיסטי: פרסום המידע הסטטיסטי המופק ברשות המקומית (דמוגרפיה/חינוך; ללא קשר למאגרי המידע)", 
            "מידע סטטיסטי: פרסום המידע הנ\"ל תוך התייחסות בעיבוד הנתונים להשלכות מגדריות; בעקבות תיקון חקיקה"
        ]
    }, 
    {
        "category": "ישיבות מועצה", 
        "fields": [
            "פרסום מועדי הישיבות ומיקומן", 
            "האם קיימת הזמנה/עידוד/קריאה לתושבים להשתתף בדיון", 
            "פרסום מסמכים וטיוטות הקשורים לישיבות הקרובות", 
            "ישיבות: מוצג מראש סדר היום (לא בפרוטוקול)", 
            "פרוטוקולים: גם בווידיאו ואודיו (לציין אם נמצאו פרוטוקולים באודיו בלבד)"
        ]
    }, 
    {
        "category": "כספים: תקציב – לפי חוק חופש המידע", 
        "fields": [
            "פרסום התקציב לשנה הנוכחית (2012)", 
            "פרסום תקציר המספק את עיקרי המידע, כולל סכומים", 
            "פרסום תקציב השנתיים הקודמות (לפי החוק: רק לשנה החולפת)", 
            "פירוט הוצאות הרשות הציבורית בשנה החולפת, לפי סעיפי התקציב", 
            "פרסום תכנון לעומת ביצוע (מקורות כספיים ושימושים לכל מחלקה)"
        ]
    }, 
    {
        "category": "כספים: תקציב – המידע אינו נדרש לפי חוק חופש המידע", 
        "fields": [
            "ריכוז מידע על סעיפי ההכנסות הגבוהים ביותר (תקבולים, זיכיונות) – כולל הסברים", 
            "ריכוז מידע על סעיפי ההוצאות הגבוהים ביותר (ספקים, דלק לסוגיו, השימוש בכלי רכב של הרשות) – כולל הסברים", 
            "פרסום חמשת מקבלי השכר הגבוה ברשות לפי תפקידים בלבד (ללא שמות)", 
            "פרסום הדו\"חות הכספיים של הרשות לשנה החולפת (2011: מאזן + דו\"ח רווח והפסד)", 
            "פרסום הדו\"חות הכספיים בשנתיים הקודמות (2009-2010)", 
            "פרסום מוקדם של סדר היום, והפרוטוקולים של דיוני התקציב בוועדת הכספים"
        ]
    }, 
    {
        "category": "כספים: ארנונה", 
        "fields": [
            "תעריפי ארנונה (פרטית, עסקית, ציבורית)", 
            "קריטריונים להנחות ופטורים בארנונה"
        ]
    }, 
    {
        "category": "חוזים ומכרזים: תשתית", 
        "fields": [
            "פרסום המכרזים באתר", 
            "פרסום קריטריונים במכרז והמשקל לכל קריטריון", 
            "האם העירייה אימצה מסמך מדיניות נגד שחיתות במכרזים", 
            "פרסום תכנון שנתי של תכניות הרכש", 
            "פרסום פרוטוקולים של ועדת הפטורים ו/או החלטות ונימוקים (פטור ממכרז ו/או הכרזה על ספק יחיד)", 
            "פרסום תוצאות המכרזים באתר העירייה (בנפרד מפרוטוקול הוועדה)", 
            "יש RSS (הודעות ע\"י אמייל/לנייד על עדכון באתר)", 
            "פרסום מתן זיכיונות על ידי העירייה"
        ]
    }, 
    {
        "category": "חוזים ומכרזים: כוח אדם", 
        "fields": [
            "פרסום המכרזים באתר", 
            "פרסום קריטריונים במכרז והמשקל לכל קריטריון", 
            "פרסום קריטריונים לקבלת עובד/ת שלא במסגרת מכרז"
        ]
    }, 
    {
        "category": "רישוי עסקים", 
        "fields": [
            "פרסום מידע על התנאים למתן רישיון עסק ותהליך הרישוי למבקשי הרישיון", 
            "פרסום מידע לציבור על הבקשות לרישוי עסקים (במיוחד באזורים שיש בהם תמהיל של מסחר ומגורים)"
        ]
    }, 
    {
        "category": "תכנון ובנייה", 
        "fields": [
            "פרסום תכניות הבנייה לאנשי מקצוע (ארכיטקטים, עורכי דין)", 
            "פרסום תכניות הבנייה בשפה ברורה ובאופן המאפשר התמצאות קלה (לדוגמה, אפשרות חיפוש/סינון ע\"פ מיקום, ע\"פ ועדות, ע\"פ לו\"ז וכד'. אפשר לתאר את המידע הקיים)", 
            "מידע קונקרטי לתושב בנושאי רישוי ופיקוח והיתרי בנייה (התהליך לאישור סגירת מרפסת)", 
            "פרסום הנוהל לשינוי ייעוד של מבני ציבור", 
            "פרסום הצעות/ מועמדים לפני שינוי ייעוד של מבני ציבור", 
            "פרסום החלטות ונימוקים לגבי שינוי ייעוד של מבני ציבור", 
            "העלאת טיוטות של תוכניות תכנון ובנייה לדיון ציבורי (לציין אם התוכניות כוללות שינוי ייעודי קרקע)", 
            "מערכת GIS (הצגת נתונים על גבי מפה) כוללת מידע על ייעודי קרקע."
        ]
    }, 
    {
        "category": "תכנון וסביבה: לפי חוק חופש המידע (סכימת ממצאים לכלל סוגי הזיהום; פירוט בטבלה)", 
        "fields": [
            "זהות המקור לפליטת הזיהום (חומרים לסביבה או לרעש, ריח או קרינה) שלא ברשות היחיד", 
            "שם החומר או קבוצת חומרים הנפלטים לסביבה, כמותם וריכוזם", 
            "הסוג והרמה של הרעש הריח והקרינה הנמדדים בסביבה", 
            "מיקום מועד ושיטת איסוף המידע וכן הגורם שאסף את המידע בעבור הרשות", 
            "אזור גיאוגרפי ומועד פליטת החומר לסביבה ויצירת הרעש, הריח החומר או הקרינה", 
            "האם החומר נפלט אל האוויר, הים, הקרקע או המים", 
            "המידע הסביבתי מוצג בליווי ביאורים והקשרים, וכולל מידע מעובד כמו דו\"חות תקופתיים"
        ]
    }, 
    {
        "category": "תכנון וסביבה: המידע אינו נדרש לפי חוק חופש המידע", 
        "fields": [
            "המידע הסביבתי כולל הסבר על ההשלכות הבריאותיות והסביבתיות של סוגי הזיהום השונים", 
            "המידע הסביבתי ברור וגלוי. לתאר את אופני הצגתו: דיווח טכני בלבד/ שורה תחתונה/ מפה/ מגמות", 
            "לציין אם, בנוסף למידע מעובד, יש גישה למאגר הנתונים (המאפשר, לדוגמה, השוואות לאורך זמן, בין רשויות, בין שכונות וכד')", 
            "האם יש פרסום של תהליכי קבלת החלטות בתחום איכות סביבה (בנוסף לבדיקת ועדת איכות הסביבה כחלק מבדיקת הוועדות לעיל)", 
            "האם יש פרסום קריטריונים לזיהום סביבתי, או קישור לחקיקה הארצית בנושא", 
            "האם קיים פרסום מדידת זיהום אויר, בתדירות גבוהה", 
            "האם יש פרסום של מיקום פחי מחזור, מכל הסוגים: נייר, רטוב, פלסטיק, זכוכית, סוללות, מצברים, שמנים", 
            "האם יש פרסום של מיקום קומפוסטרים, אתרי מחזור לפסולת", 
            "האם יש מידע על נוהל פינוי במקרה שלתושב אין יכולת לפנות בעצמו", 
            "האם יש פרסום של מספר גנים ציבוריים ביחס לשטח העיר", 
            "האם יש פרסום לגבי מיקום למסירת בגדי יד שנייה", 
            "לפרט האם קיימים מסמכים בנושאים: זיהום אוויר, מים, אנרגיה, והתייעלות אנרגטית (UN) (טווח הציונים: 0-3)  האנרגיה. יש קידום של נושא הפרדת האשפה הביתית וקריאה להצטרפות לשולחן עגול בהשתתפות התושבים לדיון על הפרויקט. יש פרויקט של נטיעות עצים http://www.ashdod.muni.il/RESIDENTSERVICE/NETIOT/Pages/default.aspx ותכנית ל\"עיר ירוקה\".", 
            "פרסום תוכניות קיימות ומדיניות פיתוח (בנייה/סביבה)"
        ]
    }, 
    {
        "category": "חברות עירוניות", 
        "fields": [
            "פרסום רשימת החברות העירוניות", 
            "פרסום רשימת חברי הדירקטוריון של כל החברות העירוניות (כולל חברי מועצה ונציגי ציבור)", 
            "קישור לאתר החברות שבבעלות העירייה, כולל בעלות חלקית, או תת-אתר באתר העירוני עבורן", 
            "דו\"חות שנתיים של החברות העירוניות"
        ]
    }
]