root = exports ? this

root.guide = [
    {
        "category": "דרכי התקשרות עם הרשות המקומית וראש הרשות", 
        "fields": [
            "הכתובת הפיזית של משרדי הרשות", 
            "מספרי טלפון (מרכזיית הרשות/שלוחות)", 
            "שעות קבלת קהל במשרדי הרשות", 
            "אימייל כללי לרשות/ טופס פניה מקוון", 
            "שם ראש הרשות", 
            "מספר טלפון של ראש הרשות", 
            "אימייל/ טופס מקוון ליצירת קשר עם ראש הרשות", 
            "קיים מוקד עירוני באתר הרשות", 
            "במוקד העירוני יש אפשרות מעקב אחר הטיפול בפניות"
        ]
    }, 
    {
        "category": "דרכי התקשרות עם האגף והמחלקה", 
        "fields": [
            "שם מנהל/ת האגף", 
            "רמת האגף: טלפון", 
            "רמת האגף: אימייל/טופס מקוון", 
            "רמת האגף: טופס פניה/ צור קשר", 
            "כתובת פיזית של האגף", 
            "שעות קבלת קהל באגף", 
            "שם מנהל/ת המחלקה (בהנחה ששמות המחלקות קיימים)", 
            "רמת המחלקה: טלפון"
        ]
    }, 
    {
        "category": "דרכי התקשרות עם חברי מועצה", 
        "fields": [
            "מופיעה רשימה של חברי מועצה ", 
            "\"רשימה של סמכויות חברי מועצה (לדוגמה", 
            " נושא תיק התחדשות עירונית", 
            " או חבר/ה בוועדה עירונית מסוימת)\"", 
            "לכל חבר/ת מועצה מצוין אימייל/טופס מקוון", 
            "מצוין מספר טלפון נייח"
        ]
    }, 
    {
        "category": " מבקר הרשות", 
        "fields": [
            "יש/אין פורומים", 
            "כן/לא נוכחות בפייסבוק / טוויטר ועוד", 
            "\"פרסום הדו\"\"ח השנתי האחרון (2011) של מבקר הרשות\"", 
            "\"פרסום דו\"\"חות השנתיים הקודמות (2009-2010) של מבקר הרשות\"", 
            "\"פרסום פרטי קשר של מבקר הרשות"
        ]
    }, 
    {
        "category": "שקיפות: לפי חוק חופש המידע", 
        "fields": [
            " ודרכי הפנייה אליו\"", 
            "\"פרסום הדו\"\"ח השנתי האחרון (2011)\"", 
            "\"פרסום דו\"\"חות השנתיים הקודמות (2010-2009)\"", 
            "המבנה הארגוני מוצג באתר", 
            "פרסום חוק חופש המידע", 
            "\"(לתאר קיומו של מידע נוסף", 
            " כמו הסברים על החוק", 
            " על נוהל הפניה", 
            " על נוהל תשלום האגרה", 
            " ועל העלויות המסבירות את הסכום הנגבה; האם הדף שבו מפורסם חוק חופש המידע כולל קישור לתקנות המידע הסביבתי)\"", 
            "פרסום שם הממונה על חופש המידע", 
            "אימייל אישי/טופס פנייה מקוון לממונה", 
            "מספר הטלפון במשרד הממונה", 
            "פרסום שם הממונה על פניות/תלונות הציבור"
        ]
    }, 
    {
        "category": "מענקים ותמיכות", 
        "fields": [
            "אימייל אישי/טופס פנייה מקוון לממונה", 
            "מספר הטלפון במשרד הממונה", 
            "רשימת מאגרי מידע", 
            "פרסום מאגרי מידע באתר", 
            "פרטי קשר למנהל/ת מאגר המידע", 
            "סקירת עיקרי פעולות הרשות המתוכננות לשנה הנוכחית (2012)", 
            "פרסום חוקי עזר עירוניים (מספיק אם יש קישור)", 
            "\"רשימת קרנות ומלגות שבמימון הרשות הציבורית (ע\"\"פ חוק חופש המידע)\"", 
            "\"קריטריונים למתן קרנות ומלגות שבמימון הרשות הציבורית (תוספת – המידע אינו נדרש ע\"\"פ חוק חופש המידע)\"", 
            "\"רשימת תמיכות וחסויות שנתנה הרשות הציבורית בשנה החולפת (ע\"\"פ חוק חופש המידע)\"", 
            "\"קריטריונים למתן תמיכות וחסויות (תוספת – המידע אינו נדרש ע\"\"פ חוק חופש המידע)\"", 
            "רשימת מוסדות הציבור שזכו לתמיכה בשנה החולפת", 
            "היקף התמיכה במוסדות הציבור", 
            "ניתן להגיש בקשה למענק באמצעות אתר האינטרנט", 
            "הקצאת מבני ציבור"
        ]
    }, 
    {
        "category": "שקיפות: תוספת – המידע אינו נדרש לפי חוק חופש המידע", 
        "fields": [
            "שינוי ייעוד של מבני ציבור", 
            "פרסום מידע בנוגע להקצאת קרקע כתמיכה למטרות ציבוריות", 
            "פרסום הקריטריונים לזכייה", 
            "פרסום שמות המבקשים", 
            "פרסום שמות הזוכים", 
            "פרסום מוקדם של סדר היום של דיוני ועדת מענקים ותמיכות"
        ]
    }, 
    {
        "category": "ישיבות מועצה", 
        "fields": [
            "פרסום פרוטוקולים של דיוני ועדת מענקים ותמיכות", 
            "פרסום קוד אתי", 
            "\"פרסום טפסים לגבי ניגודי עניינים של נבחרי ציבור ובכירים (לדוגמה", 
            " ראש הרשות וסגניו", 
            " חברי מועצה", 
            " מנכ\"\"ל והנהלה בכירה)\""
        ]
    }, 
    {
        "category": "כספים ותקציב", 
        "fields": [
            "פרסום מידע על ההסדרים למניעת ניגודי עניינים", 
            "פרסום הסכמים קואליציוניים", 
            "מידע סטטיסטי: פרסום המידע הסטטיסטי המופק ברשות המקומית (דמוגרפיה/חינוך; ללא קשר למאגרי המידע)", 
            "\"מידע סטטיסטי: פרסום המידע הנ\"\"ל תוך התייחסות בעיבוד הנתונים להשלכות מגדריות; בעקבות תיקון חקיקה\"", 
            "האם קיים מסמך מדיניות לגבי פרסום קבוע של כל ההודעות וההחלטות של הישיבות הציבוריות באתר הרשות?", 
            "פרסום מועדי הישיבות ומיקומן", 
            "האם קיימת הזמנה/עידוד/קריאה לתושבים להשתתף בדיון", 
            "פרסום מסמכים וטיוטות הקשורים לישיבות הקרובות"
        ]
    }, 
    {
        "category": "כספים ותקציב – המידע אינו נדרש לפי חוק חופש המידע", 
        "fields": [
            "ישיבות: מוצג מראש סדר היום (לא בפרוטוקול)", 
            "פרוטוקולים: גם בווידיאו ואודיו (לציין אם נמצאו פרוטוקולים באודיו בלבד)", 
            "פרסום התקציב לשנה הנוכחית (2012)", 
            "\"פרסום תקציר המספק את עיקרי המידע", 
            " כולל סכומים\""
        ]
    }, 
    {
        "category": "חוזים ומכרזים תשתית", 
        "fields": [
            "פרסום תקציב השנתיים הקודמות (לפי החוק: רק לשנה החולפת)", 
            "\"פירוט הוצאות הרשות הציבורית בשנה החולפת", 
            " לפי סעיפי התקציב\"", 
            "פרסום תכנון לעומת ביצוע (מקורות כספיים ושימושים לכל מחלקה)", 
            "\"ריכוז מידע על סעיפי ההכנסות הגבוהים ביותר (תקבולים", 
            " זיכיונות) – כולל הסברים\"", 
            "\"ריכוז מידע על סעיפי ההוצאות הגבוהים ביותר (ספקים", 
            " דלק לסוגיו"
        ]
    }, 
    {
        "category": "מכרזים כוח אדם", 
        "fields": [
            " השימוש בכלי רכב של הרשות) – כולל הסברים\"", 
            "פרסום חמשת מקבלי השכר הגבוה ברשות לפי תפקידים בלבד (ללא שמות)", 
            "\"פרסום הדו\"\"חות הכספיים של הרשות לשנה החולפת (2011: מאזן + דו\"\"ח רווח והפסד)\""
        ]
    }, 
    {
        "category": "רישוי עסקים", 
        "fields": [
            "\"פרסום הדו\"\"חות הכספיים בשנתיים הקודמות (2009-2010)\"", 
            "פרסום פרוטוקולים של דיוני התקציב בוועדת הכספים"
        ]
    }, 
    {
        "category": "תכנון ובניה", 
        "fields": [
            "\"תעריפי ארנונה (פרטית", 
            " עסקית", 
            " ציבורית)\"", 
            "קריטריונים להנחות ופטורים בארנונה", 
            "פרסום המכרזים באתר", 
            "פרסום קריטריונים במכרז והמשקל לכל קריטריון", 
            "האם העירייה אימצה מסמך מדיניות נגד שחיתות במכרזים", 
            "פרסום תכנון שנתי של תכניות הרכש"
        ]
    }, 
    {
        "category": "תכנון וסביבה: לפי חוק חופש המידע (סכימת ממצאים לכלל סוגי הזיהום; פירוט בטבלה)", 
        "fields": [
            "פרסום פרוטוקולים של ועדת הפטורים ו/או החלטות ונימוקים (פטור ממכרז ו/או הכרזה על ספק יחיד)", 
            "פרסום תוצאות המכרזים באתר העירייה (בנפרד מפרוטוקול הוועדה)", 
            "\"יש RSS (הודעות ע\"\"י אמייל/לנייד על עדכון באתר)\"", 
            "פרסום מתן זיכיונות על ידי העירייה", 
            "פרסום המכרזים באתר", 
            "פרסום קריטריונים במכרז והמשקל לכל קריטריון", 
            "פרסום קריטריונים לקבלת עובד/ת שלא במסגרת מכרז", 
            "פרסום מידע על התנאים למתן רישיון עסק ותהליך הרישוי למבקשי הרישיון", 
            "פרסום מידע לציבור על הבקשות לרישוי עסקים (במיוחד באזורים שיש בהם תמהיל של מסחר ומגורים)", 
            "\"פרסום תכניות הבנייה לאנשי מקצוע (ארכיטקטים", 
            " עורכי דין)\"", 
            "\"פרסום תכניות הבנייה בשפה ברורה ובאופן המאפשר התמצאות קלה (לדוגמה", 
            " אפשרות חיפוש/סינון ע\"\"פ מיקום", 
            " ע\"\"פ ועדות", 
            " ע\"\"פ לו\"\"ז וכד'. אפשר לתאר את המידע הקיים)\"", 
            "מידע קונקרטי לתושב בנושאי רישוי ופיקוח והיתרי בנייה (התהליך לאישור סגירת מרפסת)", 
            "פרסום הנוהל לשינוי ייעוד של מבני ציבור", 
            "פרסום הצעות/ מועמדים לפני שינוי ייעוד של מבני ציבור", 
            "פרסום החלטות ונימוקים לגבי שינוי ייעוד של מבני ציבור", 
            "העלאת טיוטות של תוכניות תכנון ובנייה לדיון ציבורי (לציין אם התוכניות כוללות שינוי ייעודי קרקע)"
        ]
    }, 
    {
        "category": "חברות עירוניות", 
        "fields": [
            "מערכת GIS (הצגת נתונים על גבי מפה) כוללת מידע על ייעודי קרקע.", 
            "\"זהות המקור לפליטת הזיהום (חומרים לסביבה או לרעש", 
            " ריח או קרינה) שלא ברשות היחיד\"", 
            "\"שם החומר או קבוצת חומרים הנפלטים לסביבה", 
            " כמותם וריכוזם\""
        ]
    }
]

root.data = [
    {
        "website": "http://www.holon.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "0.5", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "1", 
                "1"
            ], 
            [
                "0.5", 
                "0", 
                "0.5", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "2", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0.5", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "1", 
                "1", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "5", 
                "3", 
                "1", 
                "3", 
                "4", 
                "3", 
                "3", 
                "4", 
                "3", 
                "1", 
                "0", 
                "1", 
                "1", 
                "2.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "חולון", 
        "coordinates": [
            34.787386, 
            32.015832
        ], 
        "id": 1
    }, 
    {
        "website": "http://www.jerusalem.muni.il/jer_main/defaultnew.asp?lng=1", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1", 
                "1", 
                "1", 
                "2", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "2", 
                "2", 
                "2", 
                "2", 
                "2", 
                "2", 
                "2", 
                "1", 
                "6", 
                "0", 
                "1", 
                "1", 
                "1", 
                "5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "2", 
                "1"
            ], 
            [
                "1", 
                "0.5", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "ירושלים", 
        "coordinates": [
            35.213711, 
            31.768318
        ], 
        "id": 2
    }, 
    {
        "website": "http://www.tel-aviv.gov.il/Hebrew/Index.asp", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1"
            ], 
            [
                "0.5", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0.5", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0.5", 
                "1.5", 
                "2", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0.5"
            ], 
            [
                "2", 
                "3", 
                "2", 
                "3", 
                "3", 
                "1", 
                "2", 
                "4", 
                "3", 
                "1", 
                "0", 
                "1", 
                "0", 
                "7", 
                "1", 
                "0", 
                "0", 
                "1", 
                "2", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "1"
            ]
        ], 
        "name": "תל אביב-יפו", 
        "coordinates": [
            34.777821, 
            32.066157
        ], 
        "id": 3
    }, 
    {
        "website": "http://www.haifa.muni.il/haifa/Pages/haifa.aspx", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0.5", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "2", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "2", 
                "2.5", 
                "0.5", 
                "3", 
                "2", 
                "2", 
                "1", 
                "2", 
                "2", 
                "1", 
                "1", 
                "1", 
                "1", 
                "5", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0.5", 
                "0.5"
            ]
        ], 
        "name": "חיפה", 
        "coordinates": [
            34.974339, 
            32.83036
        ], 
        "id": 1
    }, 
    {
        "website": "http://www.kfar-saba.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0.5", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1.5", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "3", 
                "1", 
                "1", 
                "3", 
                "3", 
                "2", 
                "3", 
                "1", 
                "4", 
                "1", 
                "1", 
                "1", 
                "1", 
                "4", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "כפר סבא", 
        "coordinates": [
            34.907612, 
            32.178194
        ], 
        "id": 5
    }, 
    {
        "website": "http://www.hadera.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0.5", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "0.5", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "3", 
                "4", 
                "3", 
                "4", 
                "2.5", 
                "2", 
                "6", 
                "6", 
                "6", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "חדרה", 
        "coordinates": [
            34.92088, 
            32.442784
        ], 
        "id": 6
    }, 
    {
        "website": "http://www.rishonlezion.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "1", 
                "1", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0.5", 
                "1", 
                "0.5", 
                "0.5", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0.5"
            ], 
            [
                "0.5", 
                "0", 
                "1", 
                "2", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "2", 
                "2", 
                "1", 
                "2", 
                "3", 
                "1", 
                "1", 
                "1", 
                "2", 
                "0", 
                "1", 
                "1", 
                "3", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "ראשון לציון", 
        "coordinates": [
            34.80705, 
            31.961544
        ], 
        "id": 7
    }, 
    {
        "website": "http://www.beer-sheva.muni.il/openning.asp?Lang=1", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0.5", 
                "0.5", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "0.5", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "4", 
                "1", 
                "1", 
                "1", 
                "1.5", 
                "2", 
                "1", 
                "4", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "3", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "באר שבע", 
        "coordinates": [
            34.791464, 
            31.252972
        ], 
        "id": 8
    }, 
    {
        "website": "http://www.netanya.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "0.5", 
                "0.5", 
                "0", 
                "0"
            ], 
            [
                "0.5", 
                "0.5", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "0.5", 
                "2", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0.5", 
                "1", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "3", 
                "1", 
                "3", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "1"
            ]
        ], 
        "name": "נתניה", 
        "coordinates": [
            34.853197, 
            32.321457
        ], 
        "id": 9
    }, 
    {
        "website": "http://www.raanana.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0.5", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "2", 
                "2", 
                "2", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "2", 
                "0", 
                "1", 
                "1", 
                "3", 
                "0", 
                "0", 
                "0", 
                "1", 
                "3", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "רעננה", 
        "coordinates": [
            34.871328, 
            32.18478
        ], 
        "id": 10
    }, 
    {
        "website": "http://www.ramat-gan.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0.5", 
                "0.5", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0.5", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "0.5"
            ], 
            [
                "0.5", 
                "0", 
                "0.5", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "0.5", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "2", 
                "2", 
                "1", 
                "1", 
                "1", 
                "2", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "3", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ]
        ], 
        "name": "רמת גן", 
        "coordinates": [
            34.824787, 
            32.068423
        ], 
        "id": 11
    }, 
    {
        "website": "http://www.herzliya.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "0.5", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0.5", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "הרצליה", 
        "coordinates": [
            34.844677, 
            32.162412
        ], 
        "id": 12
    }, 
    {
        "website": "http://www.petah-tikva.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0.5", 
                "0", 
                "1", 
                "0.5", 
                "0.5", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0.5"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "0.5", 
                "0"
            ], 
            [
                "0", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "1", 
                "0", 
                "2", 
                "0", 
                "1", 
                "1", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "3", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "פתח תקווה", 
        "coordinates": [
            34.887764, 
            32.08404
        ], 
        "id": 13
    }, 
    {
        "website": "http://www.ashdod.muni.il/ResidentService/bitahon/Pages/mazavherum.aspx ", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0.5", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0.5", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0.5", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0.5"
            ], 
            [
                "0.5", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0.5", 
                "0.5", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0.5", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "0.5", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "4", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "אשדוד", 
        "coordinates": [
            34.655316, 
            31.80438
        ], 
        "id": 14
    }, 
    {
        "website": "http://www.rehovot.muni.il/", 
        "data": [
            [
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0.5", 
                "1", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0.5"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0"
            ], 
            [
                "0", 
                "0"
            ], 
            [
                "1", 
                "1", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ]
        ], 
        "name": "רחובות", 
        "coordinates": [
            34.811274, 
            31.89277199999999
        ], 
        "id": 15
    }, 
    {
        "website": "http://www.givatayim.muni.il/Openning.asp?Lang=1", 
        "data": [
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0.5", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0.5", 
                "1"
            ], 
            [
                "1", 
                "0.5", 
                "0.5", 
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "0", 
                "1", 
                "0", 
                "1", 
                "0", 
                "0", 
                "1", 
                "0"
            ], 
            [
                "1", 
                "0", 
                "1", 
                "1", 
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "1", 
                "2", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "1"
            ], 
            [
                "1", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "1", 
                "0"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "1"
            ], 
            [
                "0", 
                "0", 
                "0", 
                "0.5", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0", 
                "0"
            ], 
            [
                "0", 
                "1", 
                "1", 
                "0", 
                "0"
            ]
        ], 
        "name": "גבעתיים", 
        "coordinates": [
            34.808873, 
            32.072175
        ], 
        "id": 16
    }
]


root.red = d3.rgb('#ba3047')
root.blue = d3.rgb('#3d73b9')
root.rdbu = d3.interpolateLab(root.redrgb, root.bluergb)

_.templateSettings = {
  interpolate : /\{\{(.+?)\}\}/g
}

class City extends Backbone.Model
    _isInt: (n) ->
        return (typeof(n) == 'number' &&
                parseFloat(n) == parseInt(n, 10) &&
                !isNaN(n))

    _sum: (scores) ->
        return _.reduce(scores, (memo, score) ->
            return memo + score)

    _average: (scores) ->
        return @_sum(scores) / scores.length

    categoryScores: (category) ->
        return @get('data')[category]

    categoryAverage: (category) ->
        return @_average(@categoryScores(category))

    total: ->
        return @_sum(@get('data'))

    totalAverage: ->
        return @_sum(@_average(scores) for scores in @get('data'))

    totalMax: ->
        return @_sum(_.map(@get('data'), (d) -> return d.length))

    score: (category, criteria) ->
        return @get('data')[category][criteria]

    marker: (category, criteria) ->
        m = {
            geometry: {
                type: 'Point',
                coordinates: @get('coordinates'),
            },
            properties: {
                title: @get('name')
                id: @id
            }
        }

        if @_isInt(criteria)
            m['properties']['description'] = root.guide[category]['fields'][criteria]
            m['properties']['value'] = @score(category, criteria)
        else if @_isInt(category)
            m['properties']['description'] = root.guide[category]['category']
            m['properties']['value'] = @categoryAverage(category)
        else # show overall score
            m['properties']['description'] = @totalAverage()

        return m


class Cities extends Backbone.Collection
    model: City


israelExtent = new MM.Extent(33.6006300456776,   # north
                             33.9, # west
                             29.223819169667124, # south
                             36.1) # east

class CityMap extends Backbone.View
    el: $('#map')

    initialize: ->
        @render()

    render: ->
        @map = mapbox.map(@el)
        @baseLayerLocalized = mapbox.layer().id('idan.map-468vpvim').composite(false)
        @baseLayerEnglish = mapbox.layer().id('idan.map-b25l9lse').composite(false)
        @map.addTileLayer(@baseLayerLocalized)
        @map.addTileLayer(@baseLayerEnglish.disable())
        @map.ui.zoomer.add()
        @map.setPanLimits(israelExtent)
        @map.setExtent(israelExtent)
        return @

    localize: (localized) ->
        if localized
            @baseLayerLocalized.enable()
            @baseLayerEnglish.disable()
        else
            @baseLayerEnglish.enable()
            @baseLayerLocalized.disable()

class MarkerLayer extends Backbone.View
    initialize: ->
        @layer = mapbox.markers.layer()
        mapbox.markers.interaction(@layer)
        @layer.key((d) -> return d.properties.id)
        @options.map.addLayer(@layer)
        @render()
        @collection.on('all', => @render())
        @category = undefined
        @criteria = undefined

    setCriteria: (category, criteria) ->
        @category = category
        @criteria = criteria

    render: ->
        markers = @collection.map((d) ->
            return d.marker(@category, @criteria))
        @layer.features(markers)
        return @

class CityList extends Backbone.View
    tagName: 'ul'
    class: 'city_list'

    initialize: ->
        @render()
        @collection.on('all', =>
            @render())

    render: ->
        @collection.each((city) =>
            # console.log(city)
            c = new CityListItem({model: city})
            # @$el.append(c.render)
        )
        $('#content').html(@el)
        return @


class CityListItem extends Backbone.View
    tagName: 'li'
    class: 'city_listitem'

    initialize: ->
        @model.on('all', => @render())
        @render()

    render: ->
        # @$el.html("#{@model.get('name')} (#{@model.total()}/#{@model.totalMax()})")
        return @




root.data = data
root.guide = guide
root.City = City
root.Cities = Cities

root.cities = new Cities(_.map(data, (d) -> return new City(d)))


root.tryScale = (scale) ->
    $('.swatch.a').css('background-color', scale(0))
    $('.swatch.b').css('background-color', scale(0.25))
    $('.swatch.c').css('background-color', scale(0.5))
    $('.swatch.d').css('background-color', scale(0.75))
    $('.swatch.e').css('background-color', scale(1))


root.interpLab = (lowColor, highColor) ->
    scale = d3.interpolateLab(lowColor, highColor)
    tryScale(scale)

root.interpRGB = (lowColor, highColor) ->
    scale = d3.interpolateRgb(lowColor, highColor)
    tryScale(scale)

$ ->
    root.cm = new CityMap()
    root.ml = new MarkerLayer({collection: root.cities, map: cm.map})
    root.cl = new CityList({collection: root.cities})

    root.interpLab(root.red, root.blue)
